//! DOM
//Об'єктна модель документа (Document Object Model) — незалежний інтерфейс 
// для роботи з HTML-документом. Ця модель містить набір властивостей і методів,
//  що дозволяють шукати, створювати й видаляти елементи, реагувати на дії 
// користувача і багато іншого, тобто поєднує сторінку з мовою програмування.
//?DOM — це відображення HTML-документа. 
// Виглядає як деревоподібна структура, 
// у якій кожен вузол — це JavaScript-об'єкт із властивостями та методами, що
//  становить частину HTML-документа. Кожен елемент у документі, весь документ
//  в цілому, заголовок, посилання, абзац — це частини DOM цього документа, 
// тому всі вони можуть бути змінені з JavaScript-коду.
//?BOM - Об'єктна модель браузера (Browser Object Model) 
// — незалежний від мови інтерфейс для роботи з браузером. Містить набір
//  властивостей і методів, що дозволяють отримати доступ до ряду функцій 
// браузера. Саме завдяки BOM можна отримувати розміри вікна браузера, читати
//  URL, працювати з історією навігації, місцем розташування тощо.

//!Група методів elem.querySelector* 
// — це сучасний стандарт для пошуку елементів. Вони дозволяють знайти 
// елемент або групу елементів за CSS-селектором.

//?    element.querySelector(selector)
//Використовується, якщо необхідно знайти тільки один, найчастіше //!унікальний елемент.
// -  Повертає //!перший знайдений елемент
//  усередині element, що відповідає рядку CSS-селектора selector.
// -   Якщо нічого не знайдено, то поверне //!null

//?    element.querySelectorAll(selector)
// -  Повертає //!псевдомасив усіх елементів всередині element, 
// які відповідають CSS-селектору selector
// - Якщо нічого не знайдено, //!поверне порожній масив  

