//!Класи
//Приклад классу
class User {
  // Тіло класу
  constructor(name, email) {
		this.naname =name
      this.email = email

  }
}
//Класи прийнято називати з великої літери, а в назві відображати 
// тип об'єкта (іменника), що створюється.

//! Створіюємо нові єкземпляри для клссу
const mango = new User("Mango", "mango@mail.com");
// console.log(mango); // {}

const poly = new User("Poly", "poly@mail.com");
// console.log(poly); // {}

//! task#1
class Car {
  constructor(brand, model, price){
    this.brand = brand
      this.model = model
      this.price = price
  }
}
const audi = new Car("Audi", "Q3", 36000)
// console.log("🚀 ~ audi:", audi)

//! task#2
// У дрігому завдання для наглядності передаєємо переметри через обєкт
class Car2 {
  constructor({brand, model, price}){
    this.brand = brand
      this.model = model
      this.price = price
  }
}
const bmw= new Car2({ brand: "BMW", model: "X5", price: 58900 })
// console.log("🚀 ~ bmw:", bmw)

//!Методи класу 
// Це функції, які будуть доступні екземпляру в його прототипі. Вони 
// оголошуються в довільному порядку після конструктора. На відміну від 
// синтаксису методів об'єкта (вони розділяються комою), методи класу не 
// розділені жодними спеціальними символами.

class User2 {
  constructor(name, email) {
    this.name = name;
    this.email = email;
  }

  getEmail() {
    return this.email;
  }

  changeEmail(newEmail) {
    this.email = newEmail;
  }
}
const poly2 = new User2("Poly2", "poly@mail.com");
// console.log(poly2.getEmail());//Виводимо  пошту
poly2.changeEmail('secondEmailPoly@.com')// Замінюємо пошту
// console.log(poly2.getEmail());// Виводимо нову пошту

//!Приватні властивості та методи
class User3 {
  // Необов'язкове оголошення публічних властивостей
  name;
  // Обов'язкове оголошення приватних властивостей
  #email;
  #password;

  constructor(params) {
    this.name = params.name;
    this.#email = params.email;
    this.#password = params.password
  }
  getEmail() {
    return this.#email;
  }

  changeEmail(newEmail) {
    if (this.#validateEmail(newEmail)) {
    this.#email = newEmail;
  }else{
    console.log('Invalid email format'); 
  }
    
  }
// Приватний метод для валідації електронної пошти
  #validateEmail(email) {
    return email.includes('@');
  }

  getPassword(){
    return this.#password 
  }
  changePassword(newPassword){
    this.#password = newPassword
  }
}

const mango3 = new User3({
  name: "Mango",
  email: "mango@mail.com",
  password: 'qwe'
});
// console.log(mango3.name); // "Mango"
// console.log(mango3.#email); // !Виникне помилка, це приватна властивість
// console.log(mango3.getEmail())// Так видасть бо викликаєтся через метод
mango3.changeEmail("NewMango@mail.com")//?Змінюємо пошту в приватній властивості
// console.log(mango3.getEmail());// та викликаємо пошту зі зміненним значенням


//!Геттери і Сеттери
// Геттери і сеттери — це спеціальний синтаксис оголошення методів для 
// взаємодії з властивостями. Геттер і сеттер імітують звичайну публічну 
// властивість класу, але дозволяють взаємодіяти з іншими властивостями 
// зручнішим способом.
class User4 {
  #email;

  constructor(params) {
    this.name = params.name;
    this.#email = params.email;
  }

  // Геттер email
  get email() {
    return this.#email;
  }

  // Сеттер email
  set email(newEmail) {
    if(newEmail === ""|| !newEmail.includes('@')) {
    console.log("Помилка! Пошта не може бути порожнім рядком, і має містити @ !");
    return;
  }
    this.#email = newEmail;
  }
}
//Геттер і сеттер повинні називатися однаково. 
//Краще називати геттери і сеттери так само, як і властивість, з якою вони
//працюють. Геттер може існувати без сеттера, так само як і сеттер без геттера.
const mango4 = new User4({ 
	name: "Mango", 
	email: "mango@mail.com" 
});

// console.log(mango4.email); // виклик пошти
mango4.email = "mango@supermail.com";//? Заміна пошти на нову через сеттер
// console.log(mango4.email); // виклик  пошти з оновленним значенням
//!Для роботи з властивістю, яка зберігає масив або об'єкт, вони не підійдуть.

//!Статичні властивості
//Статичні властивості оголошуються в тілі класу перед конструктором . Перед 
// ім'ям властивості додається ключове слово static. Статичні властивості 
// можна використовувати як у методах класу, так і поза класом.

class User5 {
//*Cтатичні властивості
  static roles = {
    admin: "admin",
    editor: "editor",
		basic: "basic"
  };
//*Приватні властивості
  #email;
  #role;

  //*Конструтор
  constructor(params) { 
    this.#email = params.email; 
    //Якщо при. створенні нового юзеране буде заданно роль, тоді 
    // вона буде присвоена 'basic' атоматично
    this.#role = params.role || User5.roles.basic; 
  }

  //*Методи классу
  get role() {
    return this.#role;
  }

  set role(newRole) {
    this.#role = newRole;
  }
}
5
const mango5 = new User5({
  email: "mango@mail.com",
  //! Додаємо роль Адмін новому юзеру
  role: User5.roles.admin,
});

// console.log(mango5.role); // "admin"
mango5.role = User5.roles.editor;//! змінюємо роль на editor
// console.log(mango5.role); // "editor"

//!Статичні Методи
//Синтаксис оголошення статичних методів майже аналогічний статичним 
// властивостям. Єдина відмінність — значенням буде метод.
class User6 {
  static #takenEmails = [];

  static isEmailTaken(email) {
    return User6.#takenEmails.includes(email);
  }

  #email;

  constructor(params) {
    this.#email = params.email;
    User6.#takenEmails.push(params.email);
  }
}

const mango6 = new User6({ email: "mango@mail.com" });

console.log(User6.isEmailTaken("poly@mail.com")); // false
console.log(User6.isEmailTaken("mango@mail.com")); // true
//!Особливість статичних методів 
// Під час їх виклику ключове слово this посилається на сам клас. 
// Це означає, що статичний метод може отримати доступ до статичних
// властивостей класу, але не до властивостей екземпляра. Це логічно, 
// адже статичні методи викликає сам клас, а не його екземпляри.








