//! Текущаяя дата
// const date = new Date();
// console.log(date);
// "Fri Jun 18 2021 15:01:35 GMT+0300 (Eastern European Summer Time)"

//!Заданная дата
// const futureDate = new Date("2030-03-16");
// console.log(futureDate); // "Sat Mar 16 2030 00:00:00 GMT+0200"

//!Заданная дата и время
// const futureDateTime = new Date("2030-03-16T14:25:00");
// console.log(futureDateTime); // "Sat Mar 16 2030 14:25:00 GMT+0200"
//!Другой вариант записи даты
// const anoserDate = new Date(2030, 2, 16, 14, 25, 0, 0);
// console.log(anoserDate); // "Sat Mar 16 2030 14:25:00 GMT+0200 "

//

//? Для комп’ютерів відлік часу рахується в мілісекундах, що минули після
// ? опівночі 1 січня 1970 року в часовому поясі UTC (Coordinated Universal Time).
// ? Це — Unix час.
// console.log(new Date(0));
// "Thu Jan 01 1970 03:00:00 GMT+0300 (Eastern European Standard Time)"

//? Вбудований метод getTime() повертає числове значення цієї дати (timestamp)
// ? — кількість мілісекунд, що минула з півночі 1 січня 1970 року.
// const dateNow = new Date("2030-03-16T14:25:00");
// console.log(dateNow.getTime()); //

//!=================Date.now=========
// //?— це швидкий і зручний спосіб отримати поточний час у вигляді мілісекунд
// const time = Date.now(); //
// console.log("🚀 ~ time:", time);

// //Якщо ти хочеш виміряти, скільки часу займає виконання деякого коду, можна зробити так:
// const startTime = Date.now();

// // Твій код, виконуваний упродовж деякого часу
// for (let i = 0; i <= 100; i += 1) {
//   console.log(i);
// }

// const endTime = Date.now();
// const elapsedTime = endTime - startTime;

// console.log(`Elapsed time: ${elapsedTime} ms`);

//!=================Геттери і сеттери=========
//?Геттери використовуються для читання всієї дати або окремої складової.
// const date = new Date("March 16, 2030 14:25:00");
// console.log("Date: ", date); // "Sat Mar 16 2030 14:25:00 GMT+0200"

// // Повертає день місяця від 1 до 31
// console.log("Day: ", date.getDate()); // 16
// // Повертає день тижня від 0 до 6, починається з неділі
// console.log("Day of the week: ", date.getDay()); // 6
// // Повертає місяць від 0 до 11
// console.log("Month: ", date.getMonth()); // 2
// // Повертає рік з 4 цифр
// console.log("Full year: ", date.getFullYear()); // 2030
// // Повертає години
// console.log("Hours: ", date.getHours()); // 14
// // Повертає хвилини
// console.log("Minutes: ", date.getMinutes()); // 25
// // Повертає секунди
// console.log("Seconds: ", date.getSeconds()); // 0
// // Повертає мілісекунди
// console.log("Milliseconds: ", date.getMilliseconds()); // 0

//?Все, що можна прочитати — можна записати, методи для запису починаються з префікса set.
const date = new Date("March 16, 2030 14:25:00");

date.setMinutes(50);
console.log(date); // "Sat Mar 16 2030 14:50:00 GMT+0200"

date.setFullYear(2040);
console.log(date); // "Fri Mar 16 2040 14:50:00 GMT+0200"

date.setMonth(4);
console.log(date); // "Wed May 16 2040 14:50:00 GMT+0300"
